#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры,
									 "ДоступноДляСписания, IDКлиента, НомерКарты, НомерТелефона, АдресТоваров");

	Элементы.ДоступноДляСписания.Заголовок = Элементы.ДоступноДляСписания.Заголовок + " " + ДоступноДляСписания; 	
	ТабличнаяЧасть = ПолучитьИзВременногоХранилища(АдресТоваров);
	УдалитьИзВременногоХранилища(АдресТоваров);
	
	Товары.Загрузить(ТабличнаяЧасть);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Списать(Команда)
	
		Если КоличествоДляСписания > ДоступноДляСписания Тогда
			ПоказатьПредупреждение(, "Не может быть списано больше " + ДоступноДляСписания + " баллов.");
		ИначеЕсли ДоступноДляСписания = 0 Тогда 
			ПоказатьПредупреждение(, "Отсутствуют баллы для списания.");
		Иначе 
			
			Попытка	
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("НомерТелефона", НомерТелефона);
				СтруктураВозврата.Вставить("НомерКарты", НомерКарты);
				СтруктураВозврата.Вставить("IDКлиента", IDКлиента);
				СтруктураВозврата.Вставить("КоличествоДляСписания", КоличествоДляСписания);
				Закрыть(СтруктураВозврата);
				
			Исключение
			    ОбщегоНазначенияКлиент.СообщитьПользователю("Произошла ошибка, обратитесь к тех. поддержке модуля!");
			    ОписаниеОшибки = ОписаниеОшибки();
			    ТекущаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
				ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации( "RetailCRM"
																			  , "Ошибка"
																			  , ОписаниеОшибки
																			  , ТекущаяДата 
																			  , Истина);	
			КонецПопытки;
			
		КонецЕсли;

КонецПроцедуры

#КонецОбласти
