#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры,
									 "ДоступноДляСписания, IDКлиента, НомерКарты, НомерТелефона, АдресТоваров");

	Элементы.ДоступноДляСписания.Заголовок = Элементы.ДоступноДляСписания.Заголовок + " " + ДоступноДляСписания; 	
	ТабличнаяЧасть = ПолучитьИзВнутреннегоХранилища(АдресТоваров);
	Товары.Загрузить(ТабличнаяЧасть);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Списать(Команда)
	
	Попытка	
		Если КоличествоДляСписания > ДоступноДляСписания Тогда
			ПоказатьПредупреждение(, "Не может быть списано больше " + ДоступноДляСписания + " баллов.");
		ИначеЕсли ДоступноДляСписания = 0 Тогда 
			ПоказатьПредупреждение(, "Отсутствуют баллы для списания.");
		Иначе 
			СтруктураВозврата = Новый Структура;
			СтруктураВозврата.Вставить("НомерТелефона", НомерТелефона);
			СтруктураВозврата.Вставить("НомерКарты", НомерКарты);
			СтруктураВозврата.Вставить("IDКлиента", IDКлиента);
			СтруктураВозврата.Вставить("КоличествоДляСписания", КоличествоДляСписания);
			Закрыть(СтруктураВозврата);
		КонецЕсли;
	Исключение
	    ОбщегоНазначенияКлиент.СообщитьПользователю("Произошла ошибка, обратитесь к тех. поддержке модуля!");
	    ОписаниеОшибки = ОписаниеОшибки();
	    ТекущаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации( "RetailCRM"
																	  , "Ошибка"
																	  , ОписаниеОшибки
																	  , ТекущаяДата 
																	  , Истина);	
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
