
&После("ОбработкаПроведения")
Процедура crm_ОбработкаПроведения(Отказ, РежимПроведения)
    
	Если crm_RetailCRMОбщийВызовСервера.ПолучитьЗначениеКонстанты("РаботаСРозницей") и 
			crm_RetailCRMОбщийВызовСервера.ПолучитьЗначениеКонстанты("ВыгружатьЧеки") Тогда
		Попытка
			crm_RetailCRMОбщийВызовСервера.ВыгрузитьЧекВCRM(ЭтотОбъект, Ложь, Неопределено);
		Исключение
			Сообщить("Чек не был выгружен в RetailCRM");
			ЗаписьЖурналаРегистрации("ПроблемаВыгрузкиЧека",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры
