
#Область ОбработчикиСобытий

&После("ОбработкаУдаленияПроведения")
Процедура crm_ОбработкаУдаленияПроведения(Отказ)

	Если не Отказ Тогда  
		
		НаборЗаписей = РегистрыНакопления.crm_РезервыТоваров.СоздатьНаборЗаписей();	
		
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект);
		
		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

&После("ОбработкаПроведения")
Процедура crm_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладная.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	               |ГДЕ
	               |	РасходнаяНакладная.Заказ = &Заказ
	               |	И РасходнаяНакладная.Проведен
	               |	И НЕ РасходнаяНакладная.ПометкаУдаления";   
	
	Запрос.УстановитьПараметр("Заказ", ЭтотОбъект);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если не Отказ и не ПометкаУдаления и Проведен и не Выборка.Следующий() Тогда
	
		НаборЗаписей = РегистрыНакопления.crm_РезервыТоваров.СоздатьНаборЗаписей(); 
		
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект);
		
		Для каждого товар из Запасы Цикл 
			
			Если товар.Резерв <> 0 и товар.Резерв > 0 Тогда 
				
				Запись = НаборЗаписей.Добавить();
				Запись.Количество 			= товар.Количество;
				Запись.Номенклатура 		= товар.Номенклатура;
				Запись.СтруктурнаяЕдиница 	= товар.СтруктурнаяЕдиницаРезерв;
				Запись.Регистратор 			= ЭтотОбъект;  
				Запись.ВидДвижения 			= ВидДвиженияНакопления.Приход;  
				Запись.Период				= Дата;		
				
				Если crm_RetailCRMОбщийВызовСервера.ПолучитьЗначениеКонстанты("ИспользованиеХарактеристик") = Истина Тогда	
					Запись.Характеристика = товар.Характеристика;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		НаборЗаписей.Записать();
		
	КонецЕсли;   
		
КонецПроцедуры

#КонецОбласти
