#Область СлужебныеПроцедурыИФункции

Функция УНФ_ПолучитьСвойство(Наименование, НазначениеСвойства, Тип = "Свойство", ТипЗначения = "Строка") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвойстваОбъектов.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК СвойстваОбъектов
	|ГДЕ
	|	СвойстваОбъектов.Заголовок 	= &Наименование
	|	И СвойстваОбъектов.НаборСвойств = &НазначениеСвойства";
	
	Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);
	Запрос.УстановитьПараметр("Наименование", 		Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();                      
	
	ЭтоСведение = ?(Тип = "Сведение", Истина, Ложь);
	КвалификаторПеременной = Новый КвалификаторыСтроки(99, ДопустимаяДлина.Переменная);
	ТипЗначенияСвойства = Новый ОписаниеТипов("Строка"
											  ,
											  , КвалификаторПеременной);
	НазваниеТЧ	= ?(Тип = "Свойство", "ДополнительныеСведения", "ДополнительныеРеквизиты");					
	
	Если ТипЗначения = "Число" Тогда 
		КвалификаторЧисла = Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный);
		ТипЗначенияСвойства = Новый ОписаниеТипов("Число"
												 ,
												 , КвалификаторЧисла);
	КонецЕсли;
						  
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда                         
		Свойство = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		
		Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		Свойство.Наименование 				= Наименование;
		Свойство.Заголовок 					= Наименование;                
		Свойство.ЭтоДополнительноеСведение 	= ЭтоСведение;
		Свойство.НаборСвойств 				= НазначениеСвойства;
		Свойство.ТипЗначения 				= ТипЗначенияСвойства;
		Свойство.Записать();
		Свойство = Свойство.Ссылка;
		
	КонецЕсли;
	
	Если НазначениеСвойства[НазваниеТЧ].Найти(Свойство) = Неопределено Тогда
		
		НаборОбъект = НазначениеСвойства.ПолучитьОбъект();
		НоваяСтрока = НаборОбъект[НазваниеТЧ].Добавить();
		НоваяСтрока.Свойство = Свойство;
		НаборОбъект.Записать();
		
	КонецЕсли;

	Возврат Свойство;

КонецФункции

Процедура УНФ_УстановитьСвойствоУОбъекта(Объект, Свойство, Значение) Экспорт
	
	Попытка 
		ЗаписьРегистра = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Объект 	= Объект;
		ЗаписьРегистра.Свойство = Свойство;
		ЗаписьРегистра.Значение = Значение;
		ЗаписьРегистра.Записать(Истина);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("RetailCRM"
								, УровеньЖурналаРегистрации.Ошибка
								,
								,
								, ОписаниеОшибки);
	КонецПопытки;

КонецПроцедуры

Функция УНФ_ПолучитьЗначениеСвойстваОбъекта(Объект, Свойство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Объект = &Объект";

	Запрос.УстановитьПараметр("Свойство", 	Свойство);
	Запрос.УстановитьПараметр("Объект", 	Объект);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;

КонецФункции

Функция ПолучитьСвободныйОстаток(Номенклатура, Склад) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ЗапасыОстатки.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрНакопления.Запасы.Остатки КАК ЗапасыОстатки
	               |ГДЕ
	               |	ЗапасыОстатки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |	И ЗапасыОстатки.Номенклатура В(&Номенклатура)"; 
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
	
#КонецОбласти