
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура crm_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Обработка = Обработки.crm_RetailCRMОбработка.Создать();  
	ПараметрыВыгрузки = Обработка.УНФ_ВернутьСтруктуруПараметровВыгрузки();
	
	Если ТекущийОбъект.Проведен Тогда
		Отмена = Ложь;
		Если ТекущийОбъект.ПометкаУдаления Тогда
			Отмена = Истина;
		КонецЕсли;
		ПараметрыВыгрузки.ВыгрузкаСтатусаЗаказа = Истина;
		crm_RetailCRMОбщийВызовСервера.ВыгрузитьЗаказВCRM(ТекущийОбъект.Ссылка, Отмена, ПараметрыВыгрузки);
	ИначеЕсли ТекущийОбъект.ПометкаУдаления Тогда               
		crm_RetailCRMОбщийВызовСервера.ВыгрузитьЗаказВCRM(ТекущийОбъект.Ссылка, Истина, ПараметрыВыгрузки);	
	КонецЕсли;   
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти
